Конфигурация/Reports/СводкаПоКонтрагенту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Report>
		<Properties>
			<Name>СводкаПоКонтрагенту</Name>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/ТекущиеСостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСостоянияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СвязиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>СвязиДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвязанныйДокументОтправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееСообщениеСВД</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщениеСВД</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсходящихДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСвязей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееСообщениеСВД</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщениеСВД</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсходящихДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СостоянияМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>СостоянияМероприятий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияМероприятий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассмотрен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>СостоянияМероприятий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МатериалыВыступающихЗапрошены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыОтправленыНаОзнакомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученыМатериалыВыступающих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияНеПриняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияОтправлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияПриняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколГотовиться</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНеУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколПодготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМатериаламиОзнакомились</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеВСтадииПодготовки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеПроведено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаУтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНеУтверждена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>СостоянияПроектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Инициирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Планируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ВидыИсходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>ВидыИсходящихДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиВестиСоставУчастниковРабочейГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоНоменклатуреДел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключенУчетПоНоменклатуреДел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьСозданиеДокументовНеПоШаблону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСрокИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭтапыОбработкиДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаПечатьШтрихкода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНумератор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нумераторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнениеРабочихГруппДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязателенФайлОригинала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеУказаниеОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособНумерации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНумерации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВходящийНомерИДатуПолучателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСуммуДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Reports/СводкаПоКонтрагенту/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	КС = Новый КвалификаторыСтроки(500);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	ТаблицаПисем = Новый ТаблицаЗначений;
	ТаблицаПисем.Колонки.Добавить("Дата");
	ТаблицаПисем.Колонки.Добавить("Ссылка");
	ТаблицаПисем.Колонки.Добавить("Количество");
	ТаблицаПисем.Колонки.Добавить("ПометкаУдаления");
	ТаблицаПисем.Колонки.Добавить("Наименование");
	ТаблицаПисем.Колонки.Добавить("ВидОбъекта");
	ТаблицаПисем.Колонки.Добавить("Ответственный");
	ТаблицаПисем.Колонки.Добавить("Сумма");
	ТаблицаПисем.Колонки.Добавить("Валюта");
	ТаблицаПисем.Колонки.Добавить("Содержание", ОписаниеТиповС);
	ТаблицаПисем.Колонки.Добавить("ЕстьПросрочка");
	ТаблицаПисем.Колонки.Добавить("ДатаОтправки");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрКонтрагент = Настройки.ПараметрыДанных.Элементы.Найти("Контрагент").Значение;
	
	ДатаНачала = Дата(1,1,1); ДатаОкончания = Дата(1,1,1);
	Период = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если Период.Использование Тогда 
		ДатаНачала = Период.Значение.ДатаНачала;
		ДатаОкончания = Период.Значение.ДатаОкончания;
	КонецЕсли;
	
	ПараметрПометкаУдаления = Ложь;
	ПолеПометки = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Для Каждого Элемент Из Настройки.Отбор.Элементы Цикл 
		Если Элемент.ЛевоеЗначение = ПолеПометки И Элемент.Использование Тогда 
			ПараметрПометкаУдаления = Элемент.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрПометкаУдаления = Ложь;
	ПолеПометки = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	Для Каждого Элемент Из Настройки.Отбор.Элементы Цикл 
		Если Элемент.ЛевоеЗначение = ПолеПометки И Элемент.Использование Тогда 
			ПараметрПометкаУдаления = Элемент.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Контрагент", ПараметрКонтрагент);
	ПараметрыОтчета.Вставить("ПометкаУдаления", ПараметрПометкаУдаления);
	ПараметрыОтчета.Вставить("ДатаНачала", ДатаНачала);
	ПараметрыОтчета.Вставить("ДатаОкончания", ДатаОкончания);
	
	Делопроизводство.ПолучитьПисьмаКонтрагента(ТаблицаПисем, ПараметрыОтчета);
	
	// Добавляем здесь наборы для прочих объектов, т.к. иначе СКД может убирать поля на которые у пользователя нет прав.
	// Входящие документы
	Если ПравоДоступа("Чтение", Метаданные.Справочники.ВходящиеДокументы) Тогда
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Документы.Элементы.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанных.ИсточникДанных = "ИсточникДанных1";
		НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
		НаборДанных.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВходящиеДокументы.Ссылка,
			|	ТИПЗНАЧЕНИЯ(ВходящиеДокументы.Ссылка) КАК ВидОбъекта,
			|	ВЫБОР
			|		КОГДА ВходящиеДокументы.ДатаРегистрации <> ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ВходящиеДокументы.ДатаРегистрации
			|		ИНАЧЕ ВходящиеДокументы.ДатаСоздания
			|	КОНЕЦ КАК Дата,
			|	1 КАК Количество,
			|	ВходящиеДокументы.ПометкаУдаления,
			|	ВходящиеДокументы.Наименование,
			|	ВЫРАЗИТЬ(ВходящиеДокументы.Содержание КАК СТРОКА(500)) КАК Содержание,
			|	ВЫБОР
			|		КОГДА ВходящиеДокументы.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			|			ТОГДА ВходящиеДокументы.Ответственный
			|		ИНАЧЕ ВходящиеДокументы.Зарегистрировал
			|	КОНЕЦ КАК Ответственный,
			|	ВЫБОР
			|		КОГДА ВидыДокумента.УчитыватьСуммуДокумента
			|			ТОГДА ВходящиеДокументы.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Сумма,
			|	ВходящиеДокументы.Валюта,
			|	ВЫБОР
			|		КОГДА ВходящиеДокументы.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
			|				И ВходящиеДокументы.СрокИсполнения < &ТекущаяДата
			|				И ЕСТЬNULL(ТекущиеСостоянияДокументов.Состояние, ЛОЖЬ) = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Исполнен)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЕстьПросрочка,
			|	NULL КАК ДатаОтправки
			|ИЗ
			|	Справочник.ВходящиеДокументы КАК ВходящиеДокументы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВходящихДокументов КАК ВидыДокумента
			|		ПО ВходящиеДокументы.ВидДокумента = ВидыДокумента.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеСостоянияДокументов КАК ТекущиеСостоянияДокументов
			|		ПО ВходящиеДокументы.Ссылка = ТекущиеСостоянияДокументов.Документ
			|			И (ТекущиеСостоянияДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Исполнен))
			|ГДЕ
			|	ВходящиеДокументы.Отправитель = &Контрагент
			|{ГДЕ
			|	(ВЫБОР
			|			КОГДА ВходящиеДокументы.ДатаРегистрации <> ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ВходящиеДокументы.ДатаРегистрации
			|			ИНАЧЕ ВходящиеДокументы.ДатаСоздания
			|		КОНЕЦ МЕЖДУ &ДатаНачала И &ДатаОкончания)}";
			
		НаборДанных.Имя = "Входящие";
	КонецЕсли;
	
	// Исходящие документы
	Если ПравоДоступа("Чтение", Метаданные.Справочники.ИсходящиеДокументы) Тогда
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Документы.Элементы.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанных.ИсточникДанных = "ИсточникДанных1";
		НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
		НаборДанных.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсходящиеДокументыПолучатели.Ссылка,
			|	ИсходящиеДокументыПолучатели.ДатаОтправки
			|ПОМЕСТИТЬ ИсходящиеДокументыПолучатели
			|ИЗ
			|	Справочник.ИсходящиеДокументы.Получатели КАК ИсходящиеДокументыПолучатели
			|ГДЕ
			|	ИсходящиеДокументыПолучатели.Получатель = &Контрагент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СвязиДокументов.Документ,
			|	СвязиДокументов.СвязанныйДокумент
			|ПОМЕСТИТЬ СвязиДокументов
			|ИЗ
			|	РегистрСведений.СвязиДокументов КАК СвязиДокументов
			|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходящиеДокументыПолучатели КАК ИсходящиеДокументыПолучатели
			|		ПО (ИсходящиеДокументыПолучатели.Ссылка = СвязиДокументов.Документ)
			|ГДЕ
			|	СвязиДокументов.ТипСвязи = ЗНАЧЕНИЕ(Справочник.ТипыСвязей.ПолученОтвет)
			|	И ТИПЗНАЧЕНИЯ(СвязиДокументов.СвязанныйДокумент) = ТИП(Справочник.ВходящиеДокументы)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсходящиеДокументы.Ссылка,
			|	ТИПЗНАЧЕНИЯ(ИсходящиеДокументы.Ссылка) КАК ВидОбъекта,
			|	ВЫБОР
			|		КОГДА ИсходящиеДокументы.ДатаРегистрации <> ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ИсходящиеДокументы.ДатаРегистрации
			|		ИНАЧЕ ИсходящиеДокументы.ДатаСоздания
			|	КОНЕЦ КАК Дата,
			|	1 КАК Количество,
			|	ИсходящиеДокументы.ПометкаУдаления,
			|	ИсходящиеДокументы.Наименование,
			|	ВЫРАЗИТЬ(ИсходящиеДокументы.Содержание КАК СТРОКА(500)) КАК Содержание,
			|	ВЫБОР
			|		КОГДА ИсходящиеДокументы.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			|			ТОГДА ИсходящиеДокументы.Ответственный
			|		ИНАЧЕ ИсходящиеДокументы.Подготовил
			|	КОНЕЦ КАК Ответственный,
			|	ВЫБОР
			|		КОГДА ВидыДокумента.УчитыватьСуммуДокумента
			|			ТОГДА ИсходящиеДокументы.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Сумма,
			|	ИсходящиеДокументы.Валюта,
			|	ВЫБОР
			|		КОГДА ИсходящиеДокументы.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1)
			|				И ИсходящиеДокументы.СрокИсполнения < &ТекущаяДата
			|				И СвязиДокументов.СвязанныйДокумент ЕСТЬ NULL 
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЕстьПросрочка,
			|	ИсходящиеДокументыПолучатели.ДатаОтправки КАК ДатаОтправки
			|ИЗ
			|	ИсходящиеДокументыПолучатели КАК ИсходящиеДокументыПолучатели
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
			|		ПО (ИсходящиеДокументы.Ссылка = ИсходящиеДокументыПолучатели.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИсходящихДокументов КАК ВидыДокумента
			|		ПО (ИсходящиеДокументы.ВидДокумента = ВидыДокумента.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиДокументов КАК СвязиДокументов
			|		ПО (ИсходящиеДокументы.Ссылка = СвязиДокументов.Документ)
			|ГДЕ
			|	ИсходящиеДокументы.Получатели.Получатель = &Контрагент
			|{ГДЕ
			|	(ВЫБОР
			|			КОГДА ИсходящиеДокументы.ДатаРегистрации <> ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИсходящиеДокументы.ДатаРегистрации
			|			ИНАЧЕ ИсходящиеДокументы.ДатаСоздания
			|		КОНЕЦ МЕЖДУ &ДатаНачала И &ДатаОкончания)}";
			
		НаборДанных.Имя = "Исходящие";
	КонецЕсли;
	
	// Мероприятия
	Если ПравоДоступа("Чтение", Метаданные.Справочники.Мероприятия) Тогда 
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Документы.Элементы.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанных.ИсточникДанных = "ИсточникДанных1";
		НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
		НаборДанных.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникМероприятия.Ссылка,
			|	ТИПЗНАЧЕНИЯ(СправочникМероприятия.Ссылка) КАК ВидОбъекта,
			|	ВЫБОР
			|		КОГДА СправочникМероприятия.ДатаНачалаФакт <> ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА СправочникМероприятия.ДатаНачалаФакт
			|		ИНАЧЕ СправочникМероприятия.ДатаНачала
			|	КОНЕЦ КАК Дата,
			|	1 КАК Количество,
			|	СправочникМероприятия.ПометкаУдаления,
			|	СправочникМероприятия.Наименование,
			|	ВЫРАЗИТЬ(СправочникМероприятия.Описание КАК СТРОКА(500)) КАК Содержание,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СправочникМероприятия.Председатель) = ТИП(Справочник.Пользователи)
			|				И СправочникМероприятия.Председатель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			|			ТОГДА СправочникМероприятия.Председатель
			|		КОГДА ТИПЗНАЧЕНИЯ(СправочникМероприятия.Секретарь) = ТИП(Справочник.Пользователи)
			|				И СправочникМероприятия.Секретарь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			|			ТОГДА СправочникМероприятия.Секретарь
			|		КОГДА ТИПЗНАЧЕНИЯ(СправочникМероприятия.Организатор) = ТИП(Справочник.Пользователи)
			|				И СправочникМероприятия.Организатор <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			|			ТОГДА СправочникМероприятия.Организатор
			|		КОГДА СправочникМероприятия.Куратор <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			|			ТОГДА СправочникМероприятия.Куратор
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			|	КОНЕЦ КАК Ответственный,
			|	0 КАК Сумма,
			|	NULL КАК Валюта,
			|	ВЫБОР
			|		КОГДА СправочникМероприятия.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
			|				И СправочникМероприятия.ДатаОкончания < &ТекущаяДата
			|				И 1 В
			|					(ВЫБРАТЬ
			|						1
			|					ИЗ
			|						РегистрСведений.СостоянияМероприятий КАК СостоянияМероприятий
			|					ГДЕ
			|						СостоянияМероприятий.Мероприятие = СправочникМероприятия.Ссылка
			|						И СостоянияМероприятий.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияМероприятий.МероприятиеВСтадииПодготовки))
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЕстьПросрочка,
			|	NULL КАК ДатаОтправки
			|ИЗ
			|	Справочник.Мероприятия КАК СправочникМероприятия
			|ГДЕ
			|	(СправочникМероприятия.Предмет = &Контрагент
			|			ИЛИ СправочникМероприятия.Организатор = &Контрагент)
			|{ГДЕ
			|	(ВЫБОР
			|			КОГДА СправочникМероприятия.ДатаНачалаФакт <> ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА СправочникМероприятия.ДатаНачалаФакт
			|			ИНАЧЕ СправочникМероприятия.ДатаНачала
			|		КОНЕЦ МЕЖДУ &ДатаНачала И &ДатаОкончания)}";
			
		НаборДанных.Имя = "Мероприятия";
		
	КонецЕсли;
	
	// Проекты
	Если ПравоДоступа("Чтение", Метаданные.Справочники.Проекты) Тогда 
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Документы.Элементы.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанных.ИсточникДанных = "ИсточникДанных1";
		НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
		НаборДанных.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникПроекты.Ссылка,
			|	ТИПЗНАЧЕНИЯ(СправочникПроекты.Ссылка) КАК ВидОбъекта,
			|	СправочникПроекты.ТекущийПланНачало КАК Дата,
			|	1 КАК Количество,
			|	СправочникПроекты.ПометкаУдаления,
			|	СправочникПроекты.Наименование,
			|	ВЫРАЗИТЬ(СправочникПроекты.Описание КАК СТРОКА(500)) КАК Содержание,
			|	СправочникПроекты.Руководитель КАК Ответственный,
			|	0 КАК Сумма,
			|	NULL КАК Валюта,
			|	ВЫБОР
			|		КОГДА СправочникПроекты.ТекущийПланОкончание <> ДАТАВРЕМЯ(1, 1, 1)
			|				И СправочникПроекты.ТекущийПланОкончание < &ТекущаяДата
			|				И СправочникПроекты.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияПроектов.Завершен)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЕстьПросрочка,
			|	NULL КАК ДатаОтправки
			|ИЗ
			|	Справочник.Проекты КАК СправочникПроекты
			|ГДЕ
			|	(СправочникПроекты.Заказчик = &Контрагент
			|			ИЛИ СправочникПроекты.ПроектнаяКоманда.Исполнитель = &Контрагент)
			|{ГДЕ
			|	(СправочникПроекты.ТекущийПланНачало МЕЖДУ &ДатаНачала И &ДатаОкончания)}";
			
		НаборДанных.Имя = "Проекты";
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаПисем", ТаблицаПисем);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
